# IsPipingAnalysisEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..IsPipingAnalysisEnabled Property
Application Class See Also
---
Checks whether or not piping analysis is enabled, and enable or disable it.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsPipingAnalysisEnabled { get; set; }
```

Visual Basic
---
```text
Public Property IsPipingAnalysisEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsPipingAnalysisEnabled {
	bool get ();
	void set (bool value);
}
```

# Remarks
Enabling piping analysis will not take effect unless the piping discipline is also enabled.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace